<a href="https://colab.research.google.com/github/fralfaro/MAT281_2022/blob/main/labs/lab_02/lab_02.ipynb
" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


# SQL



En la carpeta data se encuentra el archivo `player_data.csv`, el cual muestra informacion b√°sica de algunos jugadores de la NBA.

<img src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQHCVR_4gPOmYYGglSV0rT1WlJtgRGnIw6Z6G68PTY1r_Qunv-6C3BDIa3jnStoNvdgcEE&usqp=CAU" align="center"/>

In [3]:
from sqlalchemy import create_engine
import pandas as pd
import os  

import warnings
warnings.filterwarnings("ignore")

In [4]:
# load table 
player_data = pd.read_csv('data/player_data.csv')
player_data.head()

,name,year_start,year_end,position,height,weight,birth_date,college
0,Alaa Abdelnaby,1991,1995,F-C,6-10,240.0,"June 24, 1968",Duke University
1,Zaid Abdul-Aziz,1969,1978,C-F,6-9,235.0,"April 7, 1946",Iowa State University
2,Kareem Abdul-Jabbar,1970,1989,C,7-2,225.0,"April 16, 1947","University of California, Los Angeles"
3,Mahmoud Abdul-Rauf,1991,2001,G,6-1,162.0,"March 9, 1969",Louisiana State University
4,Tariq Abdul-Wahad,1998,2003,F,6-6,223.0,"November 3, 1974",San Jose State University

In [5]:
# create sqlite engine
engine = create_engine('sqlite:///nba.db', echo=True)
# create connection to engine
conn = engine.connect()

In [9]:
# add the dataframe as a table in sqlite
sqlite_table = "player"
player_data.to_sql(sqlite_table, conn, if_exists='fail')

2022-10-04 08:54:12,112 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("player")
2022-10-04 08:54:12,113 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-10-04 08:54:12,115 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("player")
2022-10-04 08:54:12,115 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-10-04 08:54:12,116 INFO sqlalchemy.engine.Engine
CREATE TABLE player (
	"index" BIGINT,
	name TEXT,
	year_start BIGINT,
	year_end BIGINT,
	position TEXT,
	height TEXT,
	weight FLOAT,
	birth_date TEXT,
	college TEXT
)


2022-10-04 08:54:12,117 INFO sqlalchemy.engine.Engine [no key 0.00072s] ()
2022-10-04 08:54:12,120 INFO sqlalchemy.engine.Engine COMMIT
2022-10-04 08:54:12,120 INFO sqlalchemy.engine.Engine CREATE INDEX ix_player_index ON player ("index")
2022-10-04 08:54:12,121 INFO sqlalchemy.engine.Engine [no key 0.00044s] ()
2022-10-04 08:54:12,123 INFO sqlalchemy.engine.Engine COMMIT
2022-10-04 08:54:12,142 INFO sqlalchemy.engine.Engine INSERT INTO player ("index", name, year_start, year_end, position, height, weight, birth_date, college) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
2022-10-04 08:54:12,143 INFO sqlalchemy.engine.Engine [generated in 0.01158s] ((0, 'Alaa Abdelnaby', 1991, 1995, 'F-C', '6-10', 240.0, 'June 24, 1968', 'Duke University'), (1, 'Zaid Abdul-Aziz', 1969, 1978, 'C-F', '6-9', 235.0, 'April 7, 1946', 'Iowa State University'), (2, 'Kareem Abdul-Jabbar', 1970, 1989, 'C', '7-2', 225.0, 'April 16, 1947', 'University of California, Los Angeles'), (3, 'Mahmoud Abdul-Rauf', 1991, 2001, 'G', '6-1', 162.0, 'March 9, 1969', 'Louisiana State University'), (4, 'Tariq Abdul-Wahad', 1998, 2003, 'F', '6-6', 223.0, 'November 3, 1974', 'San Jose State University'), (5, 'Shareef Abdur-Rahim', 1997, 2008, 'F', '6-9', 225.0, 'December 11, 1976', 'University of California'), (6, 'Tom Abernethy', 1977, 1981, 'F', '6-7', 220.0, 'May 6, 1954', 'Indiana University'), (7, 'Forest Able', 1957, 1957, 'G', '6-3', 180.0, 'July 27, 1932', 'Western Kentucky University')  ... displaying 10 of 4550 total bound parameter sets ...  (4548, 'Ivica Zubac', 2017, 2018, 'C', '7-1', 265.0, 'March 18, 1997', None), (4549, 'Matt Zunic', 1949, 1949, 'G-F', '6-3', 195.0, 'December 19, 1919', 'George Washington University'))
2022-10-04 08:54:12,151 INFO sqlalchemy.engine.Engine COMMIT

4550

In [10]:
# funcion de consultas
def consulta(query,conn):
    return pd.read_sql_query(query, con=conn)

In [13]:
# ejemplo
query = """
SELECT * FROM player
"""
df = consulta(query,conn)
df

2022-10-04 08:54:26,278 INFO sqlalchemy.engine.Engine
SELECT * FROM player

2022-10-04 08:54:26,279 INFO sqlalchemy.engine.Engine [raw sql] ()

,index,name,year_start,year_end,position,height,weight,birth_date,college
0,0,Alaa Abdelnaby,1991,1995,F-C,6-10,240.0,"June 24, 1968",Duke University
1,1,Zaid Abdul-Aziz,1969,1978,C-F,6-9,235.0,"April 7, 1946",Iowa State University
2,2,Kareem Abdul-Jabbar,1970,1989,C,7-2,225.0,"April 16, 1947","University of California, Los Angeles"
3,3,Mahmoud Abdul-Rauf,1991,2001,G,6-1,162.0,"March 9, 1969",Louisiana State University
4,4,Tariq Abdul-Wahad,1998,2003,F,6-6,223.0,"November 3, 1974",San Jose State University
...,...,...,...,...,...,...,...,...,...
4545,4545,Ante Zizic,2018,2018,F-C,6-11,250.0,"January 4, 1997",None
4546,4546,Jim Zoet,1983,1983,C,7-1,240.0,"December 20, 1953",Kent State University
4547,4547,Bill Zopf,1971,1971,G,6-1,170.0,"June 7, 1948",Duquesne University
4548,4548,Ivica Zubac,2017,2018,C,7-1,265.0,"March 18, 1997",None
4549,4549,Matt Zunic,1949,1949,G-F,6-3,195.0,"December 19, 1919",George Washington University

El objetivo es tratar de obtener la mayor informaci√≥n posible de este conjunto de datos mediante c√≥digo **SQL**. Para cumplir con este objetivo debe resolver las siguientes problem√°ticas:

1. Mostrar las primeras 5 filas

In [ ]:
query = """
SELECT * FROM player
LIMIT 5
"""
consulta(query,conn)

2. Seleccionar los valores √∫nicos de la columna `position`.

3. Seleccionar y cambiar el nombre de la columna `name` por `nombre`

4. Determinar el tiempo (en a√±os) de cada jugador en su posici√≥n

5. Encontrar el valor m√°ximo de la columna `weight` por cada  valor de la columna `position`

6. Encontrar el total de jugadores por cada valor de la columna `year_start`

7. Encontrar el valor m√≠nimo, m√°ximo y promedio de la columna `weight` por cada valor de la columnas `college`

8. Filtrar por aquellos jugadores que cumplan con :
* Para la columna `year_start` tienen un valor mayor 1990 y menor a 2000
* Para la columna `position` tienen un valor de `C`,`C-F` o `F-C`
* Para la columna `college` tienen un valor distinto de `Duke University`

9. Crear dos conjuntos de datos y juntarlos en una misma *query*. Las condiciones de cada uno de los cojunto de datos son:

* **df1**:
    * Para la columna `year_start` tienen un valor mayor 1990 y menor a 2000
    * Para la columna `position` tienen un valor de `C`,`C-F` o `F-C`
   
* **df2**:
    * Para la columna `year_end` tienen un valor menor a 2000
    * Para la columna `position` tienen un valor de `G`o `F`